runs/snake3d/back_lip/2k40/RANS/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver GAMG;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0;
        minIter 1;
    }

    Phi
    {
        $p;
    }

    U
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0;
        nSweeps 1;
        minIter 1;
    }

    k
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0;
        nSweeps 1;
        minIter 1;
    }

    omega
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-6;
        relTol 0;
        nSweeps 1;
        minIter 1;
    }

} // solvers

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    consistent yes;
    residualControl
    {
        p 1e-3;
        U 1e-3;
        nut 1e-3;
        k 1e-3;
        omega 1e-3;
    }
} // SIMPLE

potentialFlow
{
    nNonOrthogonalCorrectors 10;
} // potentialFlow

relaxationFactors
{
    fields
    {
        p 0.7;
    }
    equations
    {
        U 0.9;
        k 0.7;
        omega 0.7;
    }
} // relaxationFactors

//****************************************************************************//
